Repository: arthur-a/nativeview
Catalog: nativeview/locale/*/LC_MESSAGES/nativeview.po
Languages: ru

source: This field is required.
ru: Обязательное поле.

source: None does not allow.
ru: Значение None не допускается.

source: Enter a whole number.
ru: Укажите целое число.

source: Datetime has wrong format. Use this format instead: '${format}'.
ru: Дата и время имеют не корректный формат. Используйте следующий формат: '${format}'.

source: Date has wrong format. Use this format instead: '${format}'.
ru: Дата имеет не корректный формат. Используйте следующий формат: '${format}'.

source: The submitted data was not a file.
ru: Отправленные данные не являются файлом.

source: Invalid boolean value.
ru: Недопустимое булевое значение.

source: '${value}' is not a sequence.
ru: '${value}' не является последовательностю.

source: '${value}' is not one of ${choices_values}.
ru: Значение '${value}' не пренадлежит ни одному из значений ${choices_values}.

source: '${value}' is less than minimum value ${min}.
ru: '${value}' меньше, чем ${min}.

source: '${value}' is greater than maximum value ${max}.
ru: '${value}' больше, чем ${max}.

source: Shorter than minimum length ${min}.
ru: Меньше, чем мимнимальная длина ${min}.

source: Longer than maximum length ${max}.
ru: Больше, чем максимальная длина ${max}.

source: String does not match expected pattern.
ru: Строка не соответствует шаблону.

source: Invalid email address.
ru: Не корректный адрес электронной почты.
